[M_MightyMorphin MissionDefinition]
TurnInDescription="This helps Sir Hammerlock understand that nature is not always beautiful, and how sad it would be if he didn't immediately respond, “By God, uh..''"

[M_MightyMorphin:MissionObjectiveSetDefinition_4 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Lord Hammerlock wants you there. [place]Tundra Express[-place], By forcing them to shapeshift and injecting their flesh with a special serum, he was able to learn their shapeshifting abilities. However, after witnessing the shocking transformation of the Wakers, Hammerlock hates this method and wants to kill as many amoebas as possible. He also wants to bring a modified version of Wajid's body.."
